[command]/home/runner/work/_temp/a2219422-bce4-4280-913b-ab14b6b7ec41/terraform-bin plan -no-color
aws_s3_bucket.terraform-state-demo: Refreshing state... [id=cicd-state-bucket]
aws_vpc.cicd-vpc: Refreshing state... [id=vpc-0c51895f179eba137]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_db_instance.default will be created
  + resource "aws_db_instance" "default" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "5.7"
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + name                                  = "mycicddb"
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "default.mysql5.7"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = (known after apply)
      + timezone                              = (known after apply)
      + username                              = "admin"
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_vpc.cicd-vpc will be destroyed
  - resource "aws_vpc" "cicd-vpc" {
      - arn                              = "arn:aws:ec2:us-east-1:979426164612:vpc/vpc-0c51895f179eba137" -> null
      - assign_generated_ipv6_cidr_block = false -> null
      - cidr_block                       = "10.0.0.0/16" -> null
      - default_network_acl_id           = "acl-07cdf55656d5d0f9e" -> null
      - default_route_table_id           = "rtb-085955af2364b1a71" -> null
      - default_security_group_id        = "sg-02c4377606adb615b" -> null
      - dhcp_options_id                  = "dopt-32b01648" -> null
      - enable_classiclink               = false -> null
      - enable_classiclink_dns_support   = false -> null
      - enable_dns_hostnames             = true -> null
      - enable_dns_support               = true -> null
      - id                               = "vpc-0c51895f179eba137" -> null
      - instance_tenancy                 = "default" -> null
      - main_route_table_id              = "rtb-085955af2364b1a71" -> null
      - owner_id                         = "979426164612" -> null
      - tags                             = {
          - "Name" = "cicd-vpc"
        } -> null
      - tags_all                         = {
          - "Name" = "cicd-vpc"
        } -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: aws_s3_bucket.terraform-state-demo: Refreshing state... [id=cicd-state-bucket]%0Aaws_vpc.cicd-vpc: Refreshing state... [id=vpc-0c51895f179eba137]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # aws_db_instance.default will be created%0A  + resource "aws_db_instance" "default" {%0A      + address                               = (known after apply)%0A      + allocated_storage                     = 10%0A      + apply_immediately                     = (known after apply)%0A      + arn                                   = (known after apply)%0A      + auto_minor_version_upgrade            = true%0A      + availability_zone                     = (known after apply)%0A      + backup_retention_period               = (known after apply)%0A      + backup_window                         = (known after apply)%0A      + ca_cert_identifier                    = (known after apply)%0A      + character_set_name                    = (known after apply)%0A      + copy_tags_to_snapshot                 = false%0A      + db_subnet_group_name                  = (known after apply)%0A      + delete_automated_backups              = true%0A      + endpoint                              = (known after apply)%0A      + engine                                = "mysql"%0A      + engine_version                        = "5.7"%0A      + hosted_zone_id                        = (known after apply)%0A      + id                                    = (known after apply)%0A      + identifier                            = (known after apply)%0A      + identifier_prefix                     = (known after apply)%0A      + instance_class                        = "db.t3.micro"%0A      + kms_key_id                            = (known after apply)%0A      + latest_restorable_time                = (known after apply)%0A      + license_model                         = (known after apply)%0A      + maintenance_window                    = (known after apply)%0A      + monitoring_interval                   = 0%0A      + monitoring_role_arn                   = (known after apply)%0A      + multi_az                              = (known after apply)%0A      + name                                  = "mycicddb"%0A      + option_group_name                     = (known after apply)%0A      + parameter_group_name                  = "default.mysql5.7"%0A      + password                              = (sensitive value)%0A      + performance_insights_enabled          = false%0A      + performance_insights_kms_key_id       = (known after apply)%0A      + performance_insights_retention_period = (known after apply)%0A      + port                                  = (known after apply)%0A      + publicly_accessible                   = false%0A      + replicas                              = (known after apply)%0A      + resource_id                           = (known after apply)%0A      + skip_final_snapshot                   = true%0A      + snapshot_identifier                   = (known after apply)%0A      + status                                = (known after apply)%0A      + storage_type                          = (known after apply)%0A      + tags_all                              = (known after apply)%0A      + timezone                              = (known after apply)%0A      + username                              = "admin"%0A      + vpc_security_group_ids                = (known after apply)%0A    }%0A%0A  # aws_vpc.cicd-vpc will be destroyed%0A  - resource "aws_vpc" "cicd-vpc" {%0A      - arn                              = "arn:aws:ec2:us-east-1:979426164612:vpc/vpc-0c51895f179eba137" -> null%0A      - assign_generated_ipv6_cidr_block = false -> null%0A      - cidr_block                       = "10.0.0.0/16" -> null%0A      - default_network_acl_id           = "acl-07cdf55656d5d0f9e" -> null%0A      - default_route_table_id           = "rtb-085955af2364b1a71" -> null%0A      - default_security_group_id        = "sg-02c4377606adb615b" -> null%0A      - dhcp_options_id                  = "dopt-32b01648" -> null%0A      - enable_classiclink               = false -> null%0A      - enable_classiclink_dns_support   = false -> null%0A      - enable_dns_hostnames             = true -> null%0A      - enable_dns_support               = true -> null%0A      - id                               = "vpc-0c51895f179eba137" -> null%0A      - instance_tenancy                 = "default" -> null%0A      - main_route_table_id              = "rtb-085955af2364b1a71" -> null%0A      - owner_id                         = "979426164612" -> null%0A      - tags                             = {%0A          - "Name" = "cicd-vpc"%0A        } -> null%0A      - tags_all                         = {%0A          - "Name" = "cicd-vpc"%0A        } -> null%0A    }%0A%0APlan: 1 to add, 0 to change, 1 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0
::set-output name=stdout::aws_s3_bucket.terraform-state-demo: Refreshing state... [id=cicd-state-bucket]%0Aaws_vpc.cicd-vpc: Refreshing state... [id=vpc-0c51895f179eba137]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # aws_db_instance.default will be created%0A  + resource "aws_db_instance" "default" {%0A      + address                               = (known after apply)%0A      + allocated_storage                     = 10%0A      + apply_immediately                     = (known after apply)%0A      + arn                                   = (known after apply)%0A      + auto_minor_version_upgrade            = true%0A      + availability_zone                     = (known after apply)%0A      + backup_retention_period               = (known after apply)%0A      + backup_window                         = (known after apply)%0A      + ca_cert_identifier                    = (known after apply)%0A      + character_set_name                    = (known after apply)%0A      + copy_tags_to_snapshot                 = false%0A      + db_subnet_group_name                  = (known after apply)%0A      + delete_automated_backups              = true%0A      + endpoint                              = (known after apply)%0A      + engine                                = "mysql"%0A      + engine_version                        = "5.7"%0A      + hosted_zone_id                        = (known after apply)%0A      + id                                    = (known after apply)%0A      + identifier                            = (known after apply)%0A      + identifier_prefix                     = (known after apply)%0A      + instance_class                        = "db.t3.micro"%0A      + kms_key_id                            = (known after apply)%0A      + latest_restorable_time                = (known after apply)%0A      + license_model                         = (known after apply)%0A      + maintenance_window                    = (known after apply)%0A      + monitoring_interval                   = 0%0A      + monitoring_role_arn                   = (known after apply)%0A      + multi_az                              = (known after apply)%0A      + name                                  = "mycicddb"%0A      + option_group_name                     = (known after apply)%0A      + parameter_group_name                  = "default.mysql5.7"%0A      + password                              = (sensitive value)%0A      + performance_insights_enabled          = false%0A      + performance_insights_kms_key_id       = (known after apply)%0A      + performance_insights_retention_period = (known after apply)%0A      + port                                  = (known after apply)%0A      + publicly_accessible                   = false%0A      + replicas                              = (known after apply)%0A      + resource_id                           = (known after apply)%0A      + skip_final_snapshot                   = true%0A      + snapshot_identifier                   = (known after apply)%0A      + status                                = (known after apply)%0A      + storage_type                          = (known after apply)%0A      + tags_all                              = (known after apply)%0A      + timezone                              = (known after apply)%0A      + username                              = "admin"%0A      + vpc_security_group_ids                = (known after apply)%0A    }%0A%0A  # aws_vpc.cicd-vpc will be destroyed%0A  - resource "aws_vpc" "cicd-vpc" {%0A      - arn                              = "arn:aws:ec2:us-east-1:979426164612:vpc/vpc-0c51895f179eba137" -> null%0A      - assign_generated_ipv6_cidr_block = false -> null%0A      - cidr_block                       = "10.0.0.0/16" -> null%0A      - default_network_acl_id           = "acl-07cdf55656d5d0f9e" -> null%0A      - default_route_table_id           = "rtb-085955af2364b1a71" -> null%0A      - default_security_group_id        = "sg-02c4377606adb615b" -> null%0A      - dhcp_options_id                  = "dopt-32b01648" -> null%0A      - enable_classiclink               = false -> null%0A      - enable_classiclink_dns_support   = false -> null%0A      - enable_dns_hostnames             = true -> null%0A      - enable_dns_support               = true -> null%0A      - id                               = "vpc-0c51895f179eba137" -> null%0A      - instance_tenancy                 = "default" -> null%0A      - main_route_table_id              = "rtb-085955af2364b1a71" -> null%0A      - owner_id                         = "979426164612" -> null%0A      - tags                             = {%0A          - "Name" = "cicd-vpc"%0A        } -> null%0A      - tags_all                         = {%0A          - "Name" = "cicd-vpc"%0A        } -> null%0A    }%0A%0APlan: 1 to add, 0 to change, 1 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::set-output name=stderr::
::set-output name=exitcode::0
